# MAT281

## Aplicaciones de la Matemática en la Ingeniería

Puedes ejecutar este jupyter notebook de manera interactiva:
[![Binder](../shared/images/jupyter_binder.png)](https://mybinder.org/v2/gh/sebastiandres/mat281_m02_introduccion/master?filepath=02_tabulando_datos/02_tabulando_datos.ipynb)

[![Colab](../shared/images/jupyter_colab.png)](https://colab.research.google.com/github/sebastiandres/mat281_m02_analisis_datos/blob/master//02_tabulando_datos/02_tabulando_datos.ipynb)

## ¿Qué contenido aprenderemos?
* Conocimiento básico.
* Etiqueta para datos tabulares (aka tabla).
* Pivotear una tabla.
* Despivotear una tabla

## ¿Porqué aprenderemos eso?

**1**. Resulta ser la tarea más habitual en la manipulación de datos. Garantizado: 25% del tiempo, mínimo.

**2**. Visto en twitter:

* Me: *So, first question, what's the oposite of pivoting a table?*
* Interviewee: *Ehhh, melting a table?*
* Me: *Hired!*

## 1. Datos tabulares

Los datos tabulares, como su nombre lo indica, son aquellos que han sido representarse mediante una tabla que relaciona sus atributos y valores.

Ejemplo de tabla acá.

## 1. Datos tabulares

¿Existen datos que no pueden representarse mediante una datos tabulares?

No lo sé.
Arboles y grafos sí se pueden.
En general, pareciera que existen modelos más eficientes, pero que siempre podría almacenarse (ineficientemente) como datos tabulares.

## 1. Datos tabulares

Típicamente, existen ciertas columnas que son las columnas "identificadoras" y para las cuales *debiera* existir una única fila en la tabla. 

Por otra parte, existen columnas de datos, para las cuales pueden agregarse más información.

FIGURA:

## 1. Datos tabulares

Ejemplo incorrecto de datos tabulares: una fila repetida o con información inconexa.

Ejemplo parcialmente correcto: insuficientes columnas de identificadores.

Ejemplo correco: columnas suficientes.

## 1. Datos tabulares
### wide format versus long format

Googlear

## 2. Etiqueta Datos tabulares

Antes de pasar a la tabulación de los datos, hablaremos de un tema pocas veces mencionado. ¿Cómo debemos dar formato a las tablas que compartimos? ¿Existe una *etiqueta* de datos tabulares?

El formato y diseño de una tabla es crucial: si se hace bien, los datos son faciles de revisar y comparar. Si se hace mal, dificulta y oscurece el entendimiento de la información.

Al igual que con las visualizaciones, la finalidad de un buen formato de tablas es que la información pueda ser consumida de manera correcta y rápida por una persona externa, sin posibilidad de malinterpretaciones.

## 2. Etiqueta de Datos tabulares
Las reglas básicas a considerar:
1. La fuente de todos los números debe ser uniforme y permitir comparaciones.
2. Las columnas deben tener separador de miles y, dentro de lo posible, la misma cantidad de decimales. Mientras menos, mejor.

## 2. Etiqueta de Datos tabulares

3. Mencionar las unidades en el nombre de la columna cuando sea relevante.
1. Datos numéricos deben estar alineados a la derecha.

## 2. Etiqueta de Datos tabulares

5. Datos de texto deben estar alineados a la izquierda.
1. Los títulos de las columnas deben estar alineados con sus datos.

## 2. Etiqueta de Datos tabulares

7. Usar el color de manera apropiada y frugalmente.
1. Entregar valores de agrupación según sea necesario.

## 2. Datos tabulares
Ejemplo mal formato: 

![ejemplo_1](images/2_tabla_mal_formato.png)

## 2. Datos tabulares
Ejemplo un poco mejor formato: 

![ejemplo_1](images/2_tabla_mejor_formato.png)

## 2. Datos tabulares
Ejemplo formato final: 

![ejemplo_1](images/2_tabla_mucho_mejor_formato.png)

## 3. Pivoteando una tabla

In [ ]:
import pandas as pd

## 4. Despivoteando una tabla

**Disclaimer**: No conozco una mejor traducción. En inglés tampoco se han puesto de acuerdo. He visto: *melt*, *un-pivot* y *reverse-pivot*, entre otros. Hasta ahora nadie me ha corregido con una mejor traducción.

El proceso de "des-pivotear" típicamente se realiza para poder agregar más información a una tabla de datos, o ponerla en un formato que permita un análisis apropiado.

## 4. Despivoteando una tabla

Típicamente existen 2 opciones:
1. El valor indicado para la columna es único, y sólo se requiere definir correctamente las columnas.
2. El valor indicado por la columna no es único o requiere un procesamiento adicional, y se requiere una iteración más profunda.

## 4. Despivoteando una tabla
### 4.1 Valor único: definir las columnas necesarias

In [37]:
import pandas as pd
columns = ["sala","Lu-8:00","Lu-9:00","Lu-10:00","Ma-8:00","Ma-9:00","Ma-10:00"]
data = [
        ["C201","mat1","mat1",    "","","",""],
        ["C202",    "",    "",    "","mat1","mat1",    ""],
        ["C203","fis1","fis1","fis1","fis1","fis1","fis1"],
       ]
df = pd.DataFrame(data=data, columns=columns)

In [38]:
df

   sala Lu-8:00 Lu-9:00 Lu-10:00 Ma-8:00 Ma-9:00 Ma-10:00
0  C201    mat1    mat1
1  C202                             mat1    mat1
2  C203    fis1    fis1     fis1    fis1    fis1     fis1

La documentación de melt es bastante explícita aunque no muy amigable:

In [22]:
df.melt?

Intentémoslo:

In [39]:
df

   sala Lu-8:00 Lu-9:00 Lu-10:00 Ma-8:00 Ma-9:00 Ma-10:00
0  C201    mat1    mat1
1  C202                             mat1    mat1
2  C203    fis1    fis1     fis1    fis1    fis1     fis1

In [40]:
df.melt(id_vars=["sala"]) # columnas identificadoras

    sala  variable value
0   C201   Lu-8:00  mat1
1   C202   Lu-8:00
2   C203   Lu-8:00  fis1
3   C201   Lu-9:00  mat1
4   C202   Lu-9:00
5   C203   Lu-9:00  fis1
6   C201  Lu-10:00
7   C202  Lu-10:00
8   C203  Lu-10:00  fis1
9   C201   Ma-8:00
10  C202   Ma-8:00  mat1
11  C203   Ma-8:00  fis1
12  C201   Ma-9:00
13  C202   Ma-9:00  mat1
14  C203   Ma-9:00  fis1
15  C201  Ma-10:00
16  C202  Ma-10:00
17  C203  Ma-10:00  fis1

In [41]:
df.melt(id_vars=["sala"], # columnas identificadoras
        var_name="dia-hora",   # nueva variable
        value_name="curso")  # nombre de la columna para el valor de nueva variable

    sala  dia-hora curso
0   C201   Lu-8:00  mat1
1   C202   Lu-8:00
2   C203   Lu-8:00  fis1
3   C201   Lu-9:00  mat1
4   C202   Lu-9:00
5   C203   Lu-9:00  fis1
6   C201  Lu-10:00
7   C202  Lu-10:00
8   C203  Lu-10:00  fis1
9   C201   Ma-8:00
10  C202   Ma-8:00  mat1
11  C203   Ma-8:00  fis1
12  C201   Ma-9:00
13  C202   Ma-9:00  mat1
14  C203   Ma-9:00  fis1
15  C201  Ma-10:00
16  C202  Ma-10:00
17  C203  Ma-10:00  fis1

In [42]:
df.melt(id_vars=["sala"], # columnas identificadoras
        value_vars=["Lu-8:00","Lu-9:00","Lu-10:00"], # columnas a considerar
        var_name="dia-hora",   # nueva variable
        value_name="curso")  # nombre de la columna para el valor de nueva variable

   sala  dia-hora curso
0  C201   Lu-8:00  mat1
1  C202   Lu-8:00
2  C203   Lu-8:00  fis1
3  C201   Lu-9:00  mat1
4  C202   Lu-9:00
5  C203   Lu-9:00  fis1
6  C201  Lu-10:00
7  C202  Lu-10:00
8  C203  Lu-10:00  fis1

Si sabemos que queremos todas las columnas podemos des-pivotear y renombrar inmediatamente las columnas

In [43]:
# Despivotear el dataframe, renombrando columna indexadora y de valor
df_melt = df.melt(id_vars=["sala"], var_name="dia-hora", value_name="curso")
# Eliminar filas sin contenido y ordenarlas por nombre de sala y dia-hora.
df_melt[df_melt.curso!=""].sort_values(["sala","dia-hora"])

    sala  dia-hora curso
0   C201   Lu-8:00  mat1
3   C201   Lu-9:00  mat1
10  C202   Ma-8:00  mat1
13  C202   Ma-9:00  mat1
8   C203  Lu-10:00  fis1
2   C203   Lu-8:00  fis1
5   C203   Lu-9:00  fis1
17  C203  Ma-10:00  fis1
11  C203   Ma-8:00  fis1
14  C203   Ma-9:00  fis1

## 4. Despivoteando una tabla
### 4.1 Valor único: definir las columnas necesarias
Intentémoslo con un ejemplo más complejo

In [46]:
import pandas as pd
columns = ["sala","dia","08:00","09:00","10:00"]
data = [
        ["C201","Lu", "mat1","mat1",    ""],
        ["C201","Ma", "","",""],
        ["C202","Lu", "","",""],
        ["C202","Ma", "mat1","mat1",    ""],
        ["C203","Lu", "fis1","fis1","fis1"],
        ["C203","Ma", "fis1","fis1","fis1"],
       ]
df = pd.DataFrame(data=data, columns=columns)

In [47]:
df

   sala dia 08:00 09:00 10:00
0  C201  Lu  mat1  mat1
1  C201  Ma
2  C202  Lu
3  C202  Ma  mat1  mat1
4  C203  Lu  fis1  fis1  fis1
5  C203  Ma  fis1  fis1  fis1

In [48]:
# Despivotear incorrectamente la tabla
df.melt(id_vars=["sala"], var_name="hora", value_name="curso")

    sala   hora curso
0   C201    dia    Lu
1   C201    dia    Ma
2   C202    dia    Lu
3   C202    dia    Ma
4   C203    dia    Lu
5   C203    dia    Ma
6   C201  08:00  mat1
7   C201  08:00
8   C202  08:00
9   C202  08:00  mat1
10  C203  08:00  fis1
11  C203  08:00  fis1
12  C201  09:00  mat1
13  C201  09:00
14  C202  09:00
15  C202  09:00  mat1
16  C203  09:00  fis1
17  C203  09:00  fis1
18  C201  10:00
19  C201  10:00
20  C202  10:00
21  C202  10:00
22  C203  10:00  fis1
23  C203  10:00  fis1

In [49]:
# Despivotear correctamente la tabla
df.melt(id_vars=["sala", "dia"], var_name="hora", value_name="curso")

    sala dia   hora curso
0   C201  Lu  08:00  mat1
1   C201  Ma  08:00
2   C202  Lu  08:00
3   C202  Ma  08:00  mat1
4   C203  Lu  08:00  fis1
5   C203  Ma  08:00  fis1
6   C201  Lu  09:00  mat1
7   C201  Ma  09:00
8   C202  Lu  09:00
9   C202  Ma  09:00  mat1
10  C203  Lu  09:00  fis1
11  C203  Ma  09:00  fis1
12  C201  Lu  10:00
13  C201  Ma  10:00
14  C202  Lu  10:00
15  C202  Ma  10:00
16  C203  Lu  10:00  fis1
17  C203  Ma  10:00  fis1

In [53]:
# Despivotear correctamente la tabla
df_melt = df.melt(id_vars=["sala", "dia"], var_name="hora", value_name="curso")
df_melt[df_melt.curso!=""].sort_values(["sala","dia","hora"])

    sala dia   hora curso
0   C201  Lu  08:00  mat1
6   C201  Lu  09:00  mat1
3   C202  Ma  08:00  mat1
9   C202  Ma  09:00  mat1
4   C203  Lu  08:00  fis1
10  C203  Lu  09:00  fis1
16  C203  Lu  10:00  fis1
5   C203  Ma  08:00  fis1
11  C203  Ma  09:00  fis1
17  C203  Ma  10:00  fis1

## 4. Despivoteando una tabla
### 4.1 Relaciones no únicas
Consideremos el siguiente ejemplo:

In [54]:
import pandas as pd
columns = ["sala","curso","Lu","Ma","hora"]
data = [
        ["C201","mat1","X","","8:00-10:00"],
        ["C202","mat1","","X","8:00-10:00"],
        ["C203","fis1","X","X","8:00-11:00"],
       ]
df = pd.DataFrame(data=data, columns=columns)

In [36]:
df

   sala curso Lu Ma        hora
0  C201  mat1  X     8:00-10:00
1  C202  mat1     X  8:00-10:00
2  C203  fis1  X  X  8:00-11:00

¿Cómo podríamos des-pivotear la tabla anterior?

No existe un camino único. Dependiendo de la complejidad de la operación podrían haber soluciones más faciles.

In [64]:
# Idea 1: Despivotear manualmente, si se puede.
df_Lu = df.loc[df.Lu=="X", ["sala","curso","hora"]]
df_Lu["dia"] = "Lu"
df_Lu

   sala curso        hora dia
0  C201  mat1  8:00-10:00  Lu
2  C203  fis1  8:00-11:00  Lu

In [65]:
df_Ma = df.loc[df.Ma=="X", ["sala","curso","hora"]]
df_Ma["dia"] = "Ma"
df_Ma

   sala curso        hora dia
1  C202  mat1  8:00-10:00  Ma
2  C203  fis1  8:00-11:00  Ma

In [66]:
pd.concat([df_Lu,df_Ma])

   sala curso        hora dia
0  C201  mat1  8:00-10:00  Lu
2  C203  fis1  8:00-11:00  Lu
1  C202  mat1  8:00-10:00  Ma
2  C203  fis1  8:00-11:00  Ma

#### Idea 2: 
Iterar sobre las filas y generar contenido para un nuevo dataframe.
* **Ventajas**: En general, fácil de codificar.
* **Desventaja**: puede ser lento, es ineficiente.

In [67]:
for i, row in df.iterrows():
    # Procesar cada fila
    print(row.sala, row.curso, row.Lu, row.Ma, row.hora)

C201 mat1 X  8:00-10:00
C202 mat1  X 8:00-10:00
C203 fis1 X X 8:00-11:00

In [71]:
my_columns = ["sala","curso","dia","hora"]
my_data = []
for i, df_row in df.iterrows():
    # Procesar cada fila
    if df_row.Lu=="X":
        my_row = [df_row.sala, df_row.curso, "Lu", df_row.hora]
        my_data.append(my_row)
    if df_row.Ma=="X":
        my_row = [df_row.sala, df_row.curso, "Ma", df_row.hora]
        my_data.append(my_row)
new_df = pd.DataFrame(data=my_data, columns=my_columns)
new_df

   sala curso dia        hora
0  C201  mat1  Lu  8:00-10:00
1  C202  mat1  Ma  8:00-10:00
2  C203  fis1  Lu  8:00-11:00
3  C203  fis1  Ma  8:00-11:00

In [72]:
my_columns = ["sala","curso","dia","hora"]
my_data = []
for i, df_row in df.iterrows():
    # Procesar cada fila
    for col_aux in ["Lu","Ma"]:
        if df_row[col_aux]=="X":
            my_row = [df_row.sala, df_row.curso, col_aux, df_row.hora]
            my_data.append(my_row)
new_df = pd.DataFrame(data=my_data, columns=my_columns)
new_df

   sala curso dia        hora
0  C201  mat1  Lu  8:00-10:00
1  C202  mat1  Ma  8:00-10:00
2  C203  fis1  Lu  8:00-11:00
3  C203  fis1  Ma  8:00-11:00

## Referencias:

* https://medium.com/mission-log/design-better-data-tables-430a30a00d8c
* https://medium.com/@enricobergamini/creating-non-numeric-pivot-tables-with-python-pandas-7aa9dfd788a7
* https://nikgrozev.com/2015/07/01/reshaping-in-pandas-pivot-pivot-table-stack-and-unstack-explained-with-pictures/